apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_gpdma.h
/************************************************************************************
 * arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_gpdma.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_GPDMA_H
#define __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_GPDMA_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "hardware/lpc17_40_memorymap.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/
/* Register offsets *****************************************************************/

/* General registers (see also LPC17_40_SYSCON_DMAREQSEL_OFFSET in lpc17_40_syscon.h) */

#define LPC17_40_DMA_INTST_OFFSET         0x0000 /* DMA Interrupt Status Register */
#define LPC17_40_DMA_INTTCST_OFFSET       0x0004 /* DMA Interrupt Terminal Count Request Status Register */
#define LPC17_40_DMA_INTTCCLR_OFFSET      0x0008 /* DMA Interrupt Terminal Count Request Clear Register */
#define LPC17_40_DMA_INTERRST_OFFSET      0x000c /* DMA Interrupt Error Status Register */
#define LPC17_40_DMA_INTERRCLR_OFFSET     0x0010 /* DMA Interrupt Error Clear Register */
#define LPC17_40_DMA_RAWINTTCST_OFFSET    0x0014 /* DMA Raw Interrupt Terminal Count Status Register */
#define LPC17_40_DMA_RAWINTERRST_OFFSET   0x0018 /* DMA Raw Error Interrupt Status Register */
#define LPC17_40_DMA_ENBLDCHNS_OFFSET     0x001c /* DMA Enabled Channel Register */
#define LPC17_40_DMA_SOFTBREQ_OFFSET      0x0020 /* DMA Software Burst Request Register */
#define LPC17_40_DMA_SOFTSREQ_OFFSET      0x0024 /* DMA Software Single Request Register */
#define LPC17_40_DMA_SOFTLBREQ_OFFSET     0x0028 /* DMA Software Last Burst Request Register */
#define LPC17_40_DMA_SOFTLSREQ_OFFSET     0x002c /* DMA Software Last Single Request Register */
#define LPC17_40_DMA_CONFIG_OFFSET        0x0030 /* DMA Configuration Register */
#define LPC17_40_DMA_SYNC_OFFSET          0x0034 /* DMA Synchronization Register */

/* Channel Registers */

#define LPC17_40_NDMACH                   8      /* Eight DMA channels */
#define LPC17_40_DMA_CHAN_OFFSET(n)       (0x0100 + ((n) << 5)) /* n=0,1,...,(LPC17_40_NDMACH-1) */

#define LPC17_40_DMACH_SRCADDR_OFFSET     0x0000 /* DMA Channel Source Address Register */
#define LPC17_40_DMACH_DESTADDR_OFFSET    0x0004 /* DMA Channel Destination Address Register */
#define LPC17_40_DMACH_LLI_OFFSET         0x0008 /* DMA Channel Linked List Item Register */
#define LPC17_40_DMACH_CONTROL_OFFSET     0x000c /* DMA Channel Control Register */
#define LPC17_40_DMACH_CONFIG_OFFSET      0x0010 /* DMA Channel Configuration Register */

#define LPC17_40_DMACH0_SRCADDR_OFFSET    (0x100+LPC17_40_DMACH_SRCADDR_OFFSET)
#define LPC17_40_DMACH0_DESTADDR_OFFSET   (0x100+LPC17_40_DMACH_DESTADDR_OFFSET)
#define LPC17_40_DMACH0_LLI_OFFSET        (0x100+LPC17_40_DMACH_LLI_OFFSET)
#define LPC17_40_DMACH0_CONTROL_OFFSET    (0x100+LPC17_40_DMACH_CONTROL_OFFSET)
#define LPC17_40_DMACH0_CONFIG_OFFSET     (0x100+LPC17_40_DMACH_CONFIG_OFFSET)

#define LPC17_40_DMACH1_SRCADDR_OFFSET    (0x120+LPC17_40_DMACH_SRCADDR_OFFSET)
#define LPC17_40_DMACH1_DESTADDR_OFFSET   (0x120+LPC17_40_DMACH_DESTADDR_OFFSET)
#define LPC17_40_DMACH1_LLI_OFFSET        (0x120+LPC17_40_DMACH_LLI_OFFSET)
#define LPC17_40_DMACH1_CONTROL_OFFSET    (0x120+LPC17_40_DMACH_CONTROL_OFFSET)
#define LPC17_40_DMACH1_CONFIG_OFFSET     (0x120+LPC17_40_DMACH_CONFIG_OFFSET)

#define LPC17_40_DMACH2_SRCADDR_OFFSET    (0x140+LPC17_40_DMACH_SRCADDR_OFFSET)
#define LPC17_40_DMACH2_DESTADDR_OFFSET   (0x140+LPC17_40_DMACH_DESTADDR_OFFSET)
#define LPC17_40_DMACH2_LLI_OFFSET        (0x140+LPC17_40_DMACH_LLI_OFFSET)
#define LPC17_40_DMACH2_CONTROL_OFFSET    (0x140+LPC17_40_DMACH_CONTROL_OFFSET)
#define LPC17_40_DMACH2_CONFIG_OFFSET     (0x140+LPC17_40_DMACH_CONFIG_OFFSET)

#define LPC17_40_DMACH3_SRCADDR_OFFSET    (0x160+LPC17_40_DMACH_SRCADDR_OFFSET)
#define LPC17_40_DMACH3_DESTADDR_OFFSET   (0x160+LPC17_40_DMACH_DESTADDR_OFFSET)
#define LPC17_40_DMACH3_LLI_OFFSET        (0x160+LPC17_40_DMACH_LLI_OFFSET)
#define LPC17_40_DMACH3_CONTROL_OFFSET    (0x160+LPC17_40_DMACH_CONTROL_OFFSET)
#define LPC17_40_DMACH3_CONFIG_OFFSET     (0x160+LPC17_40_DMACH_CONFIG_OFFSET)

#define LPC17_40_DMACH4_SRCADDR_OFFSET    (0x180+LPC17_40_DMACH_SRCADDR_OFFSET)
#define LPC17_40_DMACH4_DESTADDR_OFFSET   (0x180+LPC17_40_DMACH_DESTADDR_OFFSET)
#define LPC17_40_DMACH4_LLI_OFFSET        (0x180+LPC17_40_DMACH_LLI_OFFSET)
#define LPC17_40_DMACH4_CONTROL_OFFSET    (0x180+LPC17_40_DMACH_CONTROL_OFFSET)
#define LPC17_40_DMACH4_CONFIG_OFFSET     (0x180+LPC17_40_DMACH_CONFIG_OFFSET)

#define LPC17_40_DMACH5_SRCADDR_OFFSET    (0x1a0+LPC17_40_DMACH_SRCADDR_OFFSET)
#define LPC17_40_DMACH5_DESTADDR_OFFSET   (0x1a0+LPC17_40_DMACH_DESTADDR_OFFSET)
#define LPC17_40_DMACH5_LLI_OFFSET        (0x1a0+LPC17_40_DMACH_LLI_OFFSET)
#define LPC17_40_DMACH5_CONTROL_OFFSET    (0x1a0+LPC17_40_DMACH_CONTROL_OFFSET)
#define LPC17_40_DMACH5_CONFIG_OFFSET     (0x1a0+LPC17_40_DMACH_CONFIG_OFFSET)

#define LPC17_40_DMACH6_SRCADDR_OFFSET    (0x1c0+LPC17_40_DMACH_SRCADDR_OFFSET)
#define LPC17_40_DMACH6_DESTADDR_OFFSET   (0x1c0+LPC17_40_DMACH_DESTADDR_OFFSET)
#define LPC17_40_DMACH6_LLI_OFFSET        (0x1c0+LPC17_40_DMACH_LLI_OFFSET)
#define LPC17_40_DMACH6_CONTROL_OFFSET    (0x1c0+LPC17_40_DMACH_CONTROL_OFFSET)
#define LPC17_40_DMACH6_CONFIG_OFFSET     (0x1c0+LPC17_40_DMACH_CONFIG_OFFSET)

#define LPC17_40_DMACH7_SRCADDR_OFFSET    (0x1e0+LPC17_40_DMACH_SRCADDR_OFFSET)
#define LPC17_40_DMACH7_DESTADDR_OFFSET   (0x1e0+LPC17_40_DMACH_DESTADDR_OFFSET)
#define LPC17_40_DMACH7_LLI_OFFSET        (0x1e0+LPC17_40_DMACH_LLI_OFFSET)
#define LPC17_40_DMACH7_CONTROL_OFFSET    (0x1e0+LPC17_40_DMACH_CONTROL_OFFSET)
#define LPC17_40_DMACH7_CONFIG_OFFSET     (0x1e0+LPC17_40_DMACH_CONFIG_OFFSET)

