apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_gpdma.h
/* Register addresses ***************************************************************/
/* General registers (see also LPC17_40_SYSCON_DMAREQSEL in lpc17_40_syscon.h) */

#define LPC17_40_DMA_INTST                (LPC17_40_GPDMA_BASE+LPC17_40_DMA_INTST_OFFSET)
#define LPC17_40_DMA_INTTCST              (LPC17_40_GPDMA_BASE+LPC17_40_DMA_INTTCST_OFFSET)
#define LPC17_40_DMA_INTTCCLR             (LPC17_40_GPDMA_BASE+LPC17_40_DMA_INTTCCLR_OFFSET)
#define LPC17_40_DMA_INTERRST             (LPC17_40_GPDMA_BASE+LPC17_40_DMA_INTERRST_OFFSET)
#define LPC17_40_DMA_INTERRCLR            (LPC17_40_GPDMA_BASE+LPC17_40_DMA_INTERRCLR_OFFSET)
#define LPC17_40_DMA_RAWINTTCST           (LPC17_40_GPDMA_BASE+LPC17_40_DMA_RAWINTTCST_OFFSET)
#define LPC17_40_DMA_RAWINTERRST          (LPC17_40_GPDMA_BASE+LPC17_40_DMA_RAWINTERRST_OFFSET)
#define LPC17_40_DMA_ENBLDCHNS            (LPC17_40_GPDMA_BASE+LPC17_40_DMA_ENBLDCHNS_OFFSET)
#define LPC17_40_DMA_SOFTBREQ             (LPC17_40_GPDMA_BASE+LPC17_40_DMA_SOFTBREQ_OFFSET)
#define LPC17_40_DMA_SOFTSREQ             (LPC17_40_GPDMA_BASE+LPC17_40_DMA_SOFTSREQ_OFFSET)
#define LPC17_40_DMA_SOFTLBREQ            (LPC17_40_GPDMA_BASE+LPC17_40_DMA_SOFTLBREQ_OFFSET)
#define LPC17_40_DMA_SOFTLSREQ            (LPC17_40_GPDMA_BASE+LPC17_40_DMA_SOFTLSREQ_OFFSET)
#define LPC17_40_DMA_CONFIG               (LPC17_40_GPDMA_BASE+LPC17_40_DMA_CONFIG_OFFSET)
#define LPC17_40_DMA_SYNC                 (LPC17_40_GPDMA_BASE+LPC17_40_DMA_SYNC_OFFSET)

/* Channel Registers */

#define LPC17_40_DMACH_BASE(n)            (LPC17_40_GPDMA_BASE+LPC17_40_DMA_CHAN_OFFSET(n))

#define LPC17_40_DMACH_SRCADDR(n)         (LPC17_40_DMACH_BASE(n)+LPC17_40_DMACH_SRCADDR_OFFSET)
#define LPC17_40_DMACH_DESTADDR(n)        (LPC17_40_DMACH_BASE(n)+LPC17_40_DMACH_DESTADDR_OFFSET)
#define LPC17_40_DMACH_LLI(n)             (LPC17_40_DMACH_BASE(n)+LPC17_40_DMACH_LLI_OFFSET)
#define LPC17_40_DMACH_CONTROL(n)         (LPC17_40_DMACH_BASE(n)+LPC17_40_DMACH_CONTROL_OFFSET)
#define LPC17_40_DMACH_CONFIG(n)          (LPC17_40_DMACH_BASE(n)+LPC17_40_DMACH_CONFIG_OFFSET)

#define LPC17_40_DMACH0_SRCADDR           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH0_SRCADDR_OFFSET)
#define LPC17_40_DMACH0_DESTADDR          (LPC17_40_GPDMA_BASE+LPC17_40_DMACH0_DESTADDR_OFFSET)
#define LPC17_40_DMACH0_LLI               (LPC17_40_GPDMA_BASE+LPC17_40_DMACH0_LLI_OFFSET)
#define LPC17_40_DMACH0_CONTROL           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH0_CONTROL_OFFSET)
#define LPC17_40_DMACH0_CONFIG            (LPC17_40_GPDMA_BASE+LPC17_40_DMACH0_CONFIG_OFFSET)

#define LPC17_40_DMACH1_SRCADDR           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH1_SRCADDR_OFFSET)
#define LPC17_40_DMACH1_DESTADDR          (LPC17_40_GPDMA_BASE+LPC17_40_DMACH1_DESTADDR_OFFSET)
#define LPC17_40_DMACH1_LLI               (LPC17_40_GPDMA_BASE+LPC17_40_DMACH1_LLI_OFFSET)
#define LPC17_40_DMACH1_CONTROL           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH1_CONTROL_OFFSET)
#define LPC17_40_DMACH1_CONFIG            (LPC17_40_GPDMA_BASE+LPC17_40_DMACH1_CONFIG_OFFSET)

#define LPC17_40_DMACH2_SRCADDR           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH2_SRCADDR_OFFSET)
#define LPC17_40_DMACH2_DESTADDR          (LPC17_40_GPDMA_BASE+LPC17_40_DMACH2_DESTADDR_OFFSET)
#define LPC17_40_DMACH2_LLI               (LPC17_40_GPDMA_BASE+LPC17_40_DMACH2_LLI_OFFSET)
#define LPC17_40_DMACH2_CONTROL           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH2_CONTROL_OFFSET)
#define LPC17_40_DMACH2_CONFIG            (LPC17_40_GPDMA_BASE+LPC17_40_DMACH2_CONFIG_OFFSET)

#define LPC17_40_DMACH3_SRCADDR           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH3_SRCADDR_OFFSET)
#define LPC17_40_DMACH3_DESTADDR          (LPC17_40_GPDMA_BASE+LPC17_40_DMACH3_DESTADDR_OFFSET)
#define LPC17_40_DMACH3_LLI               (LPC17_40_GPDMA_BASE+LPC17_40_DMACH3_LLI_OFFSET)
#define LPC17_40_DMACH3_CONTROL           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH3_CONTROL_OFFSET)
#define LPC17_40_DMACH3_CONFIG            (LPC17_40_GPDMA_BASE+LPC17_40_DMACH3_CONFIG_OFFSET)

#define LPC17_40_DMACH4_SRCADDR           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH4_SRCADDR_OFFSET)
#define LPC17_40_DMACH4_DESTADDR          (LPC17_40_GPDMA_BASE+LPC17_40_DMACH4_DESTADDR_OFFSET)
#define LPC17_40_DMACH4_LLI               (LPC17_40_GPDMA_BASE+LPC17_40_DMACH4_LLI_OFFSET)
#define LPC17_40_DMACH4_CONTROL           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH4_CONTROL_OFFSET)
#define LPC17_40_DMACH4_CONFIG            (LPC17_40_GPDMA_BASE+LPC17_40_DMACH4_CONFIG_OFFSET)

#define LPC17_40_DMACH5_SRCADDR           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH5_SRCADDR_OFFSET)
#define LPC17_40_DMACH5_DESTADDR          (LPC17_40_GPDMA_BASE+LPC17_40_DMACH5_DESTADDR_OFFSET)
#define LPC17_40_DMACH5_LLI               (LPC17_40_GPDMA_BASE+LPC17_40_DMACH5_LLI_OFFSET)
#define LPC17_40_DMACH5_CONTROL           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH5_CONTROL_OFFSET)
#define LPC17_40_DMACH5_CONFIG            (LPC17_40_GPDMA_BASE+LPC17_40_DMACH5_CONFIG_OFFSET)

#define LPC17_40_DMACH6_SRCADDR           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH6_SRCADDR_OFFSET)
#define LPC17_40_DMACH6_DESTADDR          (LPC17_40_GPDMA_BASE+LPC17_40_DMACH6_DESTADDR_OFFSET)
#define LPC17_40_DMACH6_LLI               (LPC17_40_GPDMA_BASE+LPC17_40_DMACH6_LLI_OFFSET)
#define LPC17_40_DMACH6_CONTROL           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH6_CONTROL_OFFSET)
#define LPC17_40_DMACH6_CONFIG            (LPC17_40_GPDMA_BASE+LPC17_40_DMACH6_CONFIG_OFFSET)

#define LPC17_40_DMACH7_SRCADDR           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH7_SRCADDR_OFFSET)
#define LPC17_40_DMACH7_DESTADDR          (LPC17_40_GPDMA_BASE+LPC17_40_DMACH7_DESTADDR_OFFSET)
#define LPC17_40_DMACH7_LLI               (LPC17_40_GPDMA_BASE+LPC17_40_DMACH7_LLI_OFFSET)
#define LPC17_40_DMACH7_CONTROL           (LPC17_40_GPDMA_BASE+LPC17_40_DMACH7_CONTROL_OFFSET)
#define LPC17_40_DMACH7_CONFIG            (LPC17_40_GPDMA_BASE+LPC17_40_DMACH7_CONFIG_OFFSET)

/* Register bit definitions *********************************************************/
/* DMA Request Connections **********************************************************/

#define LPC17_40_NDMAREQ                  (16) /* The number of DMA requests */
#if defined(LPC176x)
/* Request Numbers */

#  define DMA_REQ_SSP0TX                  (0)
#  define DMA_REQ_SSP0RX                  (1)
#  define DMA_REQ_SSP1TX                  (2)
#  define DMA_REQ_SSP1RX                  (3)

