apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_gpdma.h
#  define DMA_REQ_ADC                     (4)

#  define DMA_REQ_I2SCH0                  (5)
#  define DMA_REQ_I2SCH1                  (6)

#  define DMA_REQ_DAC                     (7)

#  define DMA_REQ_UART0TX                 (8)  /* DMASEL08=0*/
#  define DMA_REQ_UART0RX                 (9)  /* DMASEL09=0*/
#  define DMA_REQ_UART1TX                 (10) /* DMASEL010=0*/
#  define DMA_REQ_UART1RX                 (11) /* DMASEL011=0*/
#  define DMA_REQ_UART2TX                 (12) /* DMASEL012=0*/
#  define DMA_REQ_UART2RX                 (13) /* DMASEL013=0*/
#  define DMA_REQ_UART3TX                 (14) /* DMASEL014=0*/
#  define DMA_REQ_UART3RX                 (15) /* DMASEL015=0*/

#  define DMA_REQ_MAT0p0                  (8)  /* DMASEL08=1 */
#  define DMA_REQ_MAT0p1                  (9)  /* DMASEL09=1 */
#  define DMA_REQ_MAT1p0                  (10) /* DMASEL010=1 */
#  define DMA_REQ_MAT1p1                  (11) /* DMASEL011=1 */
#  define DMA_REQ_MAT2p0                  (12) /* DMASEL012=1 */
#  define DMA_REQ_MAT2p1                  (13) /* DMASEL013=1 */
#  define DMA_REQ_MAT3p0                  (14) /* DMASEL014=1 */
#  define DMA_REQ_MAT3p1                  (15) /* DMASEL015=1 */

/* DMASEL values.  For the LPC176x family, only request numbers 8-15 have
 * DMASEL bits.
 */

#  define DMA_DMASEL_SSP0TX               (0)  /* Not applicable */
#  define DMA_DMASEL_SSP0RX               (0)  /* Not applicable */
#  define DMA_DMASEL_SSP1TX               (0)  /* Not applicable */
#  define DMA_DMASEL_SSP1RX               (0)  /* Not applicable */

#  define DMA_DMASEL_ADC                  (0)  /* Not applicable */

#  define DMA_DMASEL_I2SCH0               (0)  /* Not applicable */
#  define DMA_DMASEL_I2SCH1               (0)  /* Not applicable */

#  define DMA_DMASEL_DAC                  (0)  /* Not applicable */

#  define DMA_DMASEL_UART0TX              (0)
#  define DMA_DMASEL_UART0RX              (0)
#  define DMA_DMASEL_UART1TX              (0)
#  define DMA_DMASEL_UART1RX              (0)
#  define DMA_DMASEL_UART2TX              (0)
#  define DMA_DMASEL_UART2RX              (0)
#  define DMA_DMASEL_UART3TX              (0)
#  define DMA_DMASEL_UART3RX              (0)

#  define DMA_DMASEL_MAT0p0               (1)
#  define DMA_DMASEL_MAT0p1               (1)
#  define DMA_DMASEL_MAT1p0               (1)
#  define DMA_DMASEL_MAT1p1               (1)
#  define DMA_DMASEL_MAT2p0               (1)
#  define DMA_DMASEL_MAT2p1               (1)
#  define DMA_DMASEL_MAT3p0               (1)
#  define DMA_DMASEL_MAT3p1               (1)

#elif defined(LPC178x_40xx)
/* Request Numbers */

#  define DMA_REQ_SDCARD                  (1)  /* DMASEL01=0 */

#  define DMA_REQ_SSP0TX                  (2)  /* DMASEL02=0 */
#  define DMA_REQ_SSP0RX                  (3)  /* DMASEL03=0 */
#  define DMA_REQ_SSP1TX                  (4)  /* DMASEL04=0 */
#  define DMA_REQ_SSP1RX                  (5)  /* DMASEL05=0 */
#  define DMA_REQ_SSP2TX                  (6)  /* DMASEL06=0 */
#  define DMA_REQ_SSP2RX                  (7)  /* DMASEL07=0 */

#  define DMA_REQ_MAT0p0                  (0)  /* DMASEL00=1 */
#  define DMA_REQ_MAT0p1                  (1)  /* DMASEL01=1 */
#  define DMA_REQ_MAT1p0                  (2)  /* DMASEL02=1 */
#  define DMA_REQ_MAT1p1                  (3)  /* DMASEL03=1 */
#  define DMA_REQ_MAT2p0                  (4)  /* DMASEL04=1 */
#  define DMA_REQ_MAT2p1                  (5)  /* DMASEL05=1 */
#  define DMA_REQ_MAT3p0                  (14) /* DMASEL14=1 */
#  define DMA_REQ_MAT3p1                  (15) /* DMASEL15=1 */

#  define DMA_REQ_I2SCH0                  (6)  /* DMASEL06=1 */
#  define DMA_REQ_I2SCH1                  (7)  /* DMASEL07=1 */

#  define DMA_REQ_ADC                     (8)  /* Not applicable */
#  define DMA_REQ_DAC                     (9)  /* Not applicable */

#  define DMA_REQ_UART0TX                 (10)  /* DMASEL10=0 */
#  define DMA_REQ_UART0RX                 (11)  /* DMASEL11=0 */
#  define DMA_REQ_UART1TX                 (12)  /* DMASEL12=0 */
#  define DMA_REQ_UART1RX                 (13)  /* DMASEL13=0 */
#  define DMA_REQ_UART2TX                 (14)  /* DMASEL14=0 */
#  define DMA_REQ_UART2RX                 (15)  /* DMASEL15=0 */
#  define DMA_REQ_UART3TX                 (10)  /* DMASEL10=1 */
#  define DMA_REQ_UART3RX                 (11)  /* DMASEL11=1 */
#  define DMA_REQ_UART4TX                 (12)  /* DMASEL12=1 */
#  define DMA_REQ_UART4RX                 (13)  /* DMASEL13=1 */

/* DMASEL values */

#  define DMA_DMASEL_SDCARD               (0)

#  define DMA_DMASEL_SSP0TX               (0)
#  define DMA_DMASEL_SSP0RX               (0)
#  define DMA_DMASEL_SSP1TX               (0)
#  define DMA_DMASEL_SSP1RX               (0)
#  define DMA_DMASEL_SSP2TX               (0)
#  define DMA_DMASEL_SSP2RX               (0)

#  define DMA_DMASEL_MAT0p0               (1)
#  define DMA_DMASEL_MAT0p1               (1)
#  define DMA_DMASEL_MAT1p0               (1)
#  define DMA_DMASEL_MAT1p1               (1)
#  define DMA_DMASEL_MAT2p0               (1)
#  define DMA_DMASEL_MAT2p1               (1)
#  define DMA_DMASEL_MAT3p0               (1)
#  define DMA_DMASEL_MAT3p1               (1)

#  define DMA_DMASEL_I2SCH0               (1)
#  define DMA_DMASEL_I2SCH1               (1)

#  define DMA_DMASEL_ADC                  (0)  /* Not applicable */
#  define DMA_DMASEL_DAC                  (0)  /* Not applicable */

#  define DMA_DMASEL_UART0TX              (0)
#  define DMA_DMASEL_UART0RX              (0)
#  define DMA_DMASEL_UART1TX              (0)
#  define DMA_DMASEL_UART1RX              (0)
#  define DMA_DMASEL_UART2TX              (0)
#  define DMA_DMASEL_UART2RX              (0)
#  define DMA_DMASEL_UART3TX              (1)
#  define DMA_DMASEL_UART3RX              (1)
#  define DMA_DMASEL_UART4TX              (1)
#  define DMA_DMASEL_UART4RX              (1)
#endif

/* General registers (see also LPC17_40_SYSCON_DMAREQSEL in lpc17_40_syscon.h) */
/* Fach of the following registers, bits 0-7 controls DMA channels 9-7,
 * respectively.  Bits 8-31 are reserved.
 *
 *   DMA Interrupt Status Register
 *   DMA Interrupt Terminal Count Request Status Register
 *   DMA Interrupt Terminal Count Request Clear Register
 *   DMA Interrupt Error Status Register
 *   DMA Interrupt Error Clear Register
 *   DMA Raw Interrupt Terminal Count Status Register
 *   DMA Raw Error Interrupt Status Register
 *   DMA Enabled Channel Register
 */

