apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_gpdma.h
#define DMACH(n)                          (1 << (n)) /* n=0,1,...7 */
#define DMACH_ALL                         (0xff)

/* For each of the following registers, bits 0-15 represent a set of encoded
 * DMA sources. Bits 16-31 are reserved in each case.
 *
 *   DMA Software Burst Request Register
 *   DMA Software Single Request Register
 *   DMA Software Last Burst Request Register
 *   DMA Software Last Single Request Register
 *   DMA Synchronization Register
 */

#if defined(LPC176x)
#  define DMA_REQ_SSP0TX_BIT              (1 << DMA_REQ_SSP0TX)
#  define DMA_REQ_SSP0RX_BIT              (1 << DMA_REQ_SSP0RX)
#  define DMA_REQ_SSP1TX_BIT              (1 << DMA_REQ_SSP1TX)
#  define DMA_REQ_SSP1RX_BIT              (1 << DMA_REQ_SSP0RX)
#  define DMA_REQ_ADC_BIT                 (1 << DMA_REQ_ADC)
#  define DMA_REQ_I2SCH0_BIT              (1 << DMA_REQ_I2SCH0)
#  define DMA_REQ_I2SCH1_BIT              (1 << DMA_REQ_I2SCH1)
#  define DMA_REQ_DAC_BIT                 (1 << DMA_REQ_DAC)

#  define DMA_REQ_UART0TX_BIT             (1 << DMA_REQ_UART0TX)
#  define DMA_REQ_UART0RX_BIT             (1 << DMA_REQ_UART0RX)
#  define DMA_REQ_UART1TX_BIT             (1 << DMA_REQ_UART1TX)
#  define DMA_REQ_UART1RX_BIT             (1 << DMA_REQ_UART1RX)
#  define DMA_REQ_UART2TX_BIT             (1 << DMA_REQ_UART2TX)
#  define DMA_REQ_UART2RX_BIT             (1 << DMA_REQ_UART2RX)
#  define DMA_REQ_UART3TX_BIT             (1 << DMA_REQ_UART3TX)
#  define DMA_REQ_UART3RX_BIT             (1 << DMA_REQ_UART3RX)

#  define DMA_REQ_MAT0p0_BIT              (1 << DMA_REQ_MAT0p0)
#  define DMA_REQ_MAT0p1_BIT              (1 << DMA_REQ_MAT0p1)
#  define DMA_REQ_MAT1p0_BIT              (1 << DMA_REQ_MAT1p0)
#  define DMA_REQ_MAT1p1_BIT              (1 << DMA_REQ_MAT1p1)
#  define DMA_REQ_MAT2p0_BIT              (1 << DMA_REQ_MAT2p0)
#  define DMA_REQ_MAT2p1_BIT              (1 << DMA_REQ_MAT2p1)
#  define DMA_REQ_MAT3p0_BIT              (1 << DMA_REQ_MAT3p0)
#  define DMA_REQ_MAT3p1_BIT              (1 << DMA_REQ_MAT3p1)
#elif defined(LPC178x_40xx)
#  define DMA_REQ_SDCARD_BIT              (1 << DMA_REQ_SDCARD)

#  define DMA_REQ_SSP0TX_BIT              (1 << DMA_REQ_SSP0TX)
#  define DMA_REQ_SSP0RX_BIT              (1 << DMA_REQ_SSP0RX)
#  define DMA_REQ_SSP1TX_BIT              (1 << DMA_REQ_SSP1TX)
#  define DMA_REQ_SSP1RX_BIT              (1 << DMA_REQ_SSP1RX)
#  define DMA_REQ_SSP2TX_BIT              (1 << DMA_REQ_SSP2TX)
#  define DMA_REQ_SSP2RX_BIT              (1 << DMA_REQ_SSP2RX)

#  define DMA_REQ_MAT0p0_BIT              (1 << DMA_REQ_MAT0p0)
#  define DMA_REQ_MAT0p1_BIT              (1 << DMA_REQ_MAT0p1)
#  define DMA_REQ_MAT1p0_BIT              (1 << DMA_REQ_MAT1p0)
#  define DMA_REQ_MAT1p1_BIT              (1 << DMA_REQ_MAT1p1)
#  define DMA_REQ_MAT2p0_BIT              (1 << DMA_REQ_MAT2p0)
#  define DMA_REQ_MAT2p1_BIT              (1 << DMA_REQ_MAT2p1)
#  define DMA_REQ_MAT3p0_BIT              (1 << DMA_REQ_MAT3p0)
#  define DMA_REQ_MAT3p1_BIT              (1 << DMA_REQ_MAT3p1)

#  define DMA_REQ_I2SCH0_BIT              (1 << DMA_REQ_I2SCH0)
#  define DMA_REQ_I2SCH1_BIT              (1 << DMA_REQ_I2SCH1)

#  define DMA_REQ_ADC_BIT                 (1 << DMA_REQ_ADC)
#  define DMA_REQ_DAC_BIT                 (1 << DMA_REQ_DAC)

#  define DMA_REQ_UART0TX_BIT             (1 << DMA_REQ_UART0TX)
#  define DMA_REQ_UART0RX_BIT             (1 << DMA_REQ_UART0RX)
#  define DMA_REQ_UART1TX_BIT             (1 << DMA_REQ_UART1TX)
#  define DMA_REQ_UART1RX_BIT             (1 << DMA_REQ_UART1RX)
#  define DMA_REQ_UART2TX_BIT             (1 << DMA_REQ_UART2TX)
#  define DMA_REQ_UART2RX_BIT             (1 << DMA_REQ_UART2RX)
#  define DMA_REQ_UART3TX_BIT             (1 << DMA_REQ_UART3TX)
#  define DMA_REQ_UART3RX_BIT             (1 << DMA_REQ_UART3RX)
#  define DMA_REQ_UART4TX_BIT             (1 << DMA_REQ_UART4TX)
#  define DMA_REQ_UART4RX_BIT             (1 << DMA_REQ_UART4RX)
#endif

/* DMA Configuration Register */

#define DMA_CONFIG_E                      (1 << 0)  /* Bit 0:  DMA Controller enable */
#define DMA_CONFIG_M                      (1 << 1)  /* Bit 1:  AHB Master endianness configuration */
                                                    /* Bits 2-31: Reserved */
/* Channel Registers */

/* DMA Channel Source Address Register (Bits 0-31: Source Address) */
/* DMA Channel Destination Address Register Bits 0-31: Destination Address) */
/* DMA Channel Linked List Item Register (Bits 0-31: Address of next link list
 * item.  Bits 0-1 must be zero.
 */

/* DMA Channel Control Register */

#define DMACH_CONTROL_XFRSIZE_SHIFT       (0)       /* Bits 0-11: Transfer size */
#define DMACH_CONTROL_XFRSIZE_MASK        (0x0fff << DMACH_CONTROL_XFRSIZE_SHIFT)
#  define DMACH_CONTROL_XFRSIZE(n)        ((n) << DMACH_CONTROL_XFRSIZE_SHIFT)
#define DMACH_CONTROL_SBSIZE_SHIFT        (12)      /* Bits 12-14: Source burst size */
#define DMACH_CONTROL_SBSIZE_MASK         (7 << DMACH_CONTROL_SBSIZE_SHIFT)
#  define DMACH_CONTROL_SBSIZE_1          (0 << DMACH_CONTROL_SBSIZE_SHIFT)
#  define DMACH_CONTROL_SBSIZE_4          (1 << DMACH_CONTROL_SBSIZE_SHIFT)
#  define DMACH_CONTROL_SBSIZE_8          (2 << DMACH_CONTROL_SBSIZE_SHIFT)
#  define DMACH_CONTROL_SBSIZE_16         (3 << DMACH_CONTROL_SBSIZE_SHIFT)
#  define DMACH_CONTROL_SBSIZE_32         (4 << DMACH_CONTROL_SBSIZE_SHIFT)
#  define DMACH_CONTROL_SBSIZE_64         (5 << DMACH_CONTROL_SBSIZE_SHIFT)
#  define DMACH_CONTROL_SBSIZE_128        (6 << DMACH_CONTROL_SBSIZE_SHIFT)
#  define DMACH_CONTROL_SBSIZE_256        (7 << DMACH_CONTROL_SBSIZE_SHIFT)
#define DMACH_CONTROL_DBSIZE_SHIFT        (15)      /* Bits 15-17: Destination burst size */
#define DMACH_CONTROL_DBSIZE_MASK         (7 << DMACH_CONTROL_DBSIZE_SHIFT)
#  define DMACH_CONTROL_DBSIZE_1          (0 << DMACH_CONTROL_DBSIZE_SHIFT)
#  define DMACH_CONTROL_DBSIZE_4          (1 << DMACH_CONTROL_DBSIZE_SHIFT)
#  define DMACH_CONTROL_DBSIZE_8          (2 << DMACH_CONTROL_DBSIZE_SHIFT)
#  define DMACH_CONTROL_DBSIZE_16         (3 << DMACH_CONTROL_DBSIZE_SHIFT)
#  define DMACH_CONTROL_DBSIZE_32         (4 << DMACH_CONTROL_DBSIZE_SHIFT)
#  define DMACH_CONTROL_DBSIZE_64         (5 << DMACH_CONTROL_DBSIZE_SHIFT)
#  define DMACH_CONTROL_DBSIZE_128        (6 << DMACH_CONTROL_DBSIZE_SHIFT)
#  define DMACH_CONTROL_DBSIZE_256        (7 << DMACH_CONTROL_DBSIZE_SHIFT)
#define DMACH_CONTROL_SWIDTH_SHIFT        (18)      /* Bits 18-20: Source transfer width */
#define DMACH_CONTROL_SWIDTH_MASK         (7 << DMACH_CONTROL_SWIDTH_SHIFT)
#  define DMACH_CONTROL_SWIDTH_8BIT       (0 << DMACH_CONTROL_SWIDTH_SHIFT) /* Byte (8-bit) */
#  define DMACH_CONTROL_SWIDTH_16BIT      (1 << DMACH_CONTROL_SWIDTH_SHIFT) /* Halfword (16-bit) */
#  define DMACH_CONTROL_SWIDTH_32BIT      (2 << DMACH_CONTROL_SWIDTH_SHIFT) /* Word (32-bit) */
#define DMACH_CONTROL_DWIDTH_SHIFT        (21)      /* Bits 21-23: Destination transfer width */
#define DMACH_CONTROL_DWIDTH_MASK         (7 << DMACH_CONTROL_DWIDTH_SHIFT)
#  define DMACH_CONTROL_DWIDTH_8BIT       (0 << DMACH_CONTROL_DWIDTH_SHIFT) /* Byte (8-bit) */
#  define DMACH_CONTROL_DWIDTH_16BIT      (1 << DMACH_CONTROL_DWIDTH_SHIFT) /* Halfword (16-bit) */
#  define DMACH_CONTROL_DWIDTH_32BIT      (2 << DMACH_CONTROL_DWIDTH_SHIFT) /* Word (32-bit) */
#define DMACH_CONTROL_SI                  (1 << 26) /* Bit 26: Source increment */
#define DMACH_CONTROL_DI                  (1 << 27) /* Bit 27: Destination increment */
#define DMACH_CONTROL_PROT1               (1 << 28) /* Bit 28: User/privileged mode */
#define DMACH_CONTROL_PROT2               (1 << 29) /* Bit 29: Bufferable */
#define DMACH_CONTROL_PROT3               (1 << 30) /* Bit 30: Cacheable */
#define DMACH_CONTROL_I                   (1 << 31) /* Bit 31: Terminal count interrupt enable */

/* DMA Channel Configuration Register */

#define DMACH_CONFIG_E                    (1 << 0) /* Bit 0: Channel enable */
#define DMACH_CONFIG_SRCPER_SHIFT         (1)      /* Bits 1-5: Source peripheral */
#define DMACH_CONFIG_SRCPER_MASK          (31 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_SDCARD      (DMA_REQ_SDCARD << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_SSP0TX      (DMA_REQ_SSP0TX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_SSP0RX      (DMA_REQ_SSP0RX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_SSP1TX      (DMA_REQ_SSP1TX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_SSP1RX      (DMA_REQ_SSP1RX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_SSP2TX      (DMA_REQ_SSP2TX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_SSP2RX      (DMA_REQ_SSP2RX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_I2SCH0      (DMA_REQ_I2SCH0 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_I2SCH1      (DMA_REQ_I2SCH1 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_ADC         (DMA_REQ_ADC << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_DAC         (DMA_REQ_DAC << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART0TX     (DMA_REQ_UART0TX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART0RX     (DMA_REQ_UART0RX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART1TX     (DMA_REQ_UART1TX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART1RX     (DMA_REQ_UART1RX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART2TX     (DMA_REQ_UART2TX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART2RX     (DMA_REQ_UART2RX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART3TX     (DMA_REQ_UART3TX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART3RX     (DMA_REQ_UART3RX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART4TX     (DMA_REQ_UART4TX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_UART4RX     (DMA_REQ_UART4RX << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_MAT0p0      (DMA_REQ_MAT0p0 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_MAT0p1      (DMA_REQ_MAT0p1 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_MAT1p0      (DMA_REQ_MAT1p0 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_MAT1p1      (DMA_REQ_MAT1p1 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_MAT2p0      (DMA_REQ_MAT2p0 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_MAT2p1      (DMA_REQ_MAT2p1 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_MAT3p0      (DMA_REQ_MAT3p0 << DMACH_CONFIG_SRCPER_SHIFT)
#  define DMACH_CONFIG_SRCPER_MAT3p1      (DMA_REQ_MAT3p1 << DMACH_CONFIG_SRCPER_SHIFT)
#define DMACH_CONFIG_DSTPER_SHIFT         (6)      /* Bits 6-10: Destination peripheral */
#define DMACH_CONFIG_DSTPER_MASK          (31 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_SDCARD      (DMA_REQ_SDCARD << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_SSP0TX      (DMA_REQ_SSP0TX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_SSP0RX      (DMA_REQ_SSP0RX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_SSP1TX      (DMA_REQ_SSP1TX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_SSP1RX      (DMA_REQ_SSP1RX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_SSP2TX      (DMA_REQ_SSP2TX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_SSP2RX      (DMA_REQ_SSP2RX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_I2SCH0      (DMA_REQ_I2SCH0 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_I2SCH1      (DMA_REQ_I2SCH1 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_ADC         (DMA_REQ_ADC << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_DAC         (DMA_REQ_DAC << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART0TX     (DMA_REQ_UART0TX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART0RX     (DMA_REQ_UART0RX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART1TX     (DMA_REQ_UART1TX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART1RX     (DMA_REQ_UART1RX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART2TX     (DMA_REQ_UART2TX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART2RX     (DMA_REQ_UART2RX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART3TX     (DMA_REQ_UART3TX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART3RX     (DMA_REQ_UART3RX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART4TX     (DMA_REQ_UART4TX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_UART4RX     (DMA_REQ_UART4RX << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_MAT0p0      (DMA_REQ_MAT0p0 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_MAT0p1      (DMA_REQ_MAT0p1 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_MAT1p0      (DMA_REQ_MAT1p0 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_MAT1p1      (DMA_REQ_MAT1p1 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_MAT2p0      (DMA_REQ_MAT2p0 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_MAT2p1      (DMA_REQ_MAT2p1 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_MAT3p0      (DMA_REQ_MAT3p0 << DMACH_CONFIG_DSTPER_SHIFT)
#  define DMACH_CONFIG_DSTPER_MAT3p1      (DMA_REQ_MAT3p1 << DMACH_CONFIG_DSTPER_SHIFT)
#define DMACH_CONFIG_XFRTYPE_SHIFT        (11)      /* Bits 11-13: Type of transfer */
#define DMACH_CONFIG_XFRTYPE_MASK         (7 << DMACH_CONFIG_XFRTYPE_SHIFT)
                                                                            /* Flow controller = DMA controller */
#  define DMACH_CONFIG_XFRTYPE_M2M        (0 << DMACH_CONFIG_XFRTYPE_SHIFT) /*   Memory to memory */
#  define DMACH_CONFIG_XFRTYPE_M2P        (1 << DMACH_CONFIG_XFRTYPE_SHIFT) /*   Memory to peripheral */
#  define DMACH_CONFIG_XFRTYPE_P2M        (2 << DMACH_CONFIG_XFRTYPE_SHIFT) /*   Peripheral to memory */
#  define DMACH_CONFIG_XFRTYPE_P2P        (3 << DMACH_CONFIG_XFRTYPE_SHIFT) /*   Peripheral to peripheral */
#ifdef LPC178x_40xx
                                                                            /* Flow controller = Dest peripheral */
#  define DMACH_CONFIG_XFRTYPE_M2M_DC     (4 << DMACH_CONFIG_XFRTYPE_SHIFT) /* Memory to memory */
#  define DMACH_CONFIG_XFRTYPE_M2P_DC     (5 << DMACH_CONFIG_XFRTYPE_SHIFT) /* Memory to peripheral */
                                                                            /* Flow controller = Source peripheral */
#  define DMACH_CONFIG_XFRTYPE_P2M_SC     (6 << DMACH_CONFIG_XFRTYPE_SHIFT) /* Peripheral to memory */
#  define DMACH_CONFIG_XFRTYPE_P2P_SC     (7 << DMACH_CONFIG_XFRTYPE_SHIFT) /* Peripheral to peripheral */
#endif
#define DMACH_CONFIG_IE                   (1 << 14) /* Bit 14: Interrupt error mask */
#define DMACH_CONFIG_ITC                  (1 << 15) /* Bit 15: Terminal count interrupt mask */
#define DMACH_CONFIG_L                    (1 << 16) /* Bit 16: Lock */
#define DMACH_CONFIG_A                    (1 << 17) /* Bit 17: Active */
#define DMACH_CONFIG_H                    (1 << 18) /* Bit 18: Halt */
                                                    /* Bits 19-31: Reserved */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_GPDMA_H */
